msg.org
#+HTML_HEAD: -*- fill-column: 92 -*-

#+TITLE: Модуль сообщений их тесты

#+NAME:css
#+BEGIN_HTML
<link rel="stylesheet" type="text/css" href="css/css.css" />
#+END_HTML

* Введение

  Как залогиненный пользователь я хочу иметь возможность послать сообщение другому
  зарегистрированному на сайте пользователю.

  Как залогиненный пользователь я хочу иметь возможность читать свои отправленные другим
  пользователям сообщения. Также я хочу знать, доставлены они или нет (т.е. были ли
  прочитаны адресатом).

  Как залогиненный пользователь я хочу иметь возможность читать пришедшие мне от других
  пользователей сообщения.

  Как зарегистрированный пользователь я хочу получать email-уведомления о новых сообщениях
  и отключить эту функцию при необходимости.

  Как администратор сайта я хочу запрещать пользователю писать сообщения некоторым или всем
  зарегистрированным пользователям

  Иногда еще хочется получать уведомления о доставке сообщения

  Как модератор кармы я хочу регулировать кол-во отосланных пользователем сообщений в
  зависимости от его кармы, чтобы избежать рассылок спама.

  Что нам для этого нужно?
  - Сущность =User=, имеющая поле =id=
  - Сущность =Msg=, имеющая поля =snd_id=, =rcv_id=, =msg=
  - Движок создания форм, функции которого определены не здесь

  Как это работает?

  =При отправке сообщения= пользователь вводит адресата сообщения и текст сообщения, которые
  передаются контроллеру отправки сообщения. Контроллер отправки извлекает эти данные
  (=get-msg-data=), проверяет возможность отсылки сообщения (=check-msg-data=) и, в случае
  успеха, вызывает событие =crete-msg=, которое создает сообщение. В случае неудачи
  возбуждает ошибку, которую перехватит интерфейс сообщений. Сообщение создается
  недоставленным.

  Когда адресат сообщения (reciver) хочет узнать кол-во своих новых сообщений - он
  запрашивает функцию =get-undelivered-msg-cnt=.

  Если он хочет получить все идентификаторы непрочитанных сообщений, он вызывает
  =get-undelivered-msg-ids=

  Чтобы получить конкретное сообщение, адресат должен вызвать событие =delivery-msg=

  Страницы:
  - Страница отправки сообщения пользователю - на самом деле это должен быть попап на
    странице пользователя. Но пока сделаем так, чтобы снизить связность
  - Страница переписки с конкретным пользова

* Шаблоны

  Соберем шаблоны списка диалогов и самих элементов этого списка

  #+NAME: msg_tpl
  #+BEGIN_SRC closure-template-html :tangle src/mod/msg/msg-tpl.htm :noweb tangle :exports code
    // -*- mode: closure-template-html; fill-column: 140 -*-
    {namespace msgtpl}

    {template dialogs}
      <div style="border: 1px solid green">
          <table>
              {$content | noAutoescape}
          </table>
      </div>
    {/template}

    {template dlgrcv}
      <tr>
          <td>-></td>
          <td>{$id | noAutoescape}</td>
          <td>{$time | noAutoescape}</td>
          <td>{$from | noAutoescape}</td>
          <td>{$msg | noAutoescape}</td>
          <td>{$state | noAutoescape}</td>
      </tr>
    {/template}

    {template dlgsnd}
      <tr>
          <td><-</td>
          <td>{$id | noAutoescape}</td>
          <td>{$time | noAutoescape}</td>
          <td>{$to | noAutoescape}</td>
          <td>{$msg | noAutoescape}</td>
          <td>{$state | noAutoescape}</td>
      </tr>
    {/template}

  #+END_SRC

* Функционал

  Скомпилируем шаблоны при подготовке модуля

  #+NAME: msg_prepare
  #+BEGIN_SRC lisp :tangle src/mod/msg/msg-prepare.lisp :noweb tangle :exports code
    (in-package #:moto)

    ;; Скомпилируем шаблон
    (closure-template:compile-template
     :common-lisp-backend
     (pathname
      (concatenate 'string *base-path* "mod/msg/msg-tpl.htm")))
  #+END_SRC


  Соберем контроллеры и все функции, которые контроллеры вызывают

  #+NAME: msg_fn
  #+BEGIN_SRC lisp :tangle src/mod/msg/msg.lisp :noweb tangle :exports code
    (in-package #:moto)

    <<msg_fn_contents>>

    <<msg_test>>
  #+END_SRC

  Мы вводим:

** Страница диалогов

   На странице диалогов мы хотим видеть список всех диалогов. В каждом диалоге мы хотим
   видеть последнее сообщение. Чтобы получить последние сообщения мы вызываем
   =get-last-msg-dialog-ids-for-user-id=.

   Не стоит пытаться называть маршрут =msg= так как это конфликтует с именем сущности,
   определенным в этом же пакете

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp
     (in-package #:moto)

     ;; Страница сообщений
     (restas:define-route im ("/im")
       (with-wrapper
         (concatenate
          'string
          "<h1>Страница сообщений</h1>"
          (if (not *current-user*)
              "Невозможно посмотреть сообщения - пользователь не залогинен. <a href=\"/login\">Login</a>"
              (let ((msgs (get-last-msg-dialog-ids-for-user-id *current-user*)))
                (if (equal 0 (length msgs))
                    "Нет сообщений"
                    (msgtpl:dialogs
                     (list
                      :content
                      (format nil "~{~A~}"
                              (loop :for item :in msgs :collect
                                 (cond ((equal :rcv (car (last item)))
                                        (msgtpl:dlgrcv
                                         (list :id (car item)
                                               :from (cadr item)
                                               :time (caddr item)
                                               :msg (cadddr item)
                                               :state (nth 4 item)
                                               )))
                                       ((equal :snd (car (last item)))
                                        (msgtpl:dlgsnd
                                         (list :id (car item)
                                               :to (cadr item)
                                               :time (caddr item)
                                               :msg (cadddr item)
                                               :state (nth 4 item)
                                               )))
                                        (t (err "unknown dialog type")))
                                        ))))))))))

   #+END_SRC

