msg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Модуль сообщений их тесты</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Модуль сообщений их тесты"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-10-15T00:17+0400"/>
<meta name="author" content="rigidus"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Модуль сообщений их тесты</h1>




<link rel="stylesheet" type="text/css" href="css/css.css" />


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Введение</a></li>
<li><a href="#sec-2">2 Шаблоны</a></li>
<li><a href="#sec-3">3 Функционал</a>
<ul>
<li><a href="#sec-3-1">3.1 Шаблон</a></li>
<li><a href="#sec-3-2">3.2 Страница диалогов</a></li>
<li><a href="#sec-3-3">3.3 Событие отправки сообщения</a></li>
<li><a href="#sec-3-4">3.4 Функция получения кол-ва непрочитанных сообщений</a></li>
<li><a href="#sec-3-5">3.5 Функция получения идентификторов непрочитанных сообщений</a></li>
<li><a href="#sec-3-6">3.6 Событие доставки сообщения</a></li>
<li><a href="#sec-3-7">3.7 Функция получения последних сообщений диалогов для данного пользователя</a></li>
<li><a href="#sec-3-8">3.8 Функция отображения одного сообщения в списке сообщений</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Тесты</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Введение</h2>
<div class="outline-text-2" id="text-1">


<p>
  Как залогиненный пользователь я хочу иметь возможность послать сообщение другому
  зарегистрированному на сайте пользователю.
</p>
<p>
  Как залогиненный пользователь я хочу иметь возможность читать свои отправленные другим
  пользователям сообщения. Также я хочу знать, доставлены они или нет (т.е. были ли
  прочитаны адресатом).
</p>
<p>
  Как залогиненный пользователь я хочу иметь возможность читать пришедшие мне от других
  пользователей сообщения.
</p>
<p>
  Как зарегистрированный пользователь я хочу получать email-уведомления о новых сообщениях
  и отключить эту функцию при необходимости.
</p>
<p>
  Как администратор сайта я хочу запрещать пользователю писать сообщения некоторым или всем
  зарегистрированным пользователям
</p>
<p>
  Иногда еще хочется получать уведомления о доставке сообщения
</p>
<p>
  Как модератор кармы я хочу регулировать кол-во отосланных пользователем сообщений в
  зависимости от его кармы, чтобы избежать рассылок спама.
</p>
<p>
  Что нам для этого нужно?
</p><ul>
<li>Сущность <code>User</code>, имеющая поле <code>id</code>
</li>
<li>Сущность <code>Msg</code>, имеющая поля <code>snd_id</code>, <code>rcv_id</code>, <code>msg</code>
</li>
<li>Движок создания форм, функции которого определены не здесь
</li>
</ul>


<p>
  Как это работает?
</p>
<p>
  <code>При отправке сообщения</code> пользователь вводит адресата сообщения и текст сообщения, которые
  передаются контроллеру отправки сообщения. Контроллер отправки извлекает эти данные
  (<code>get-msg-data</code>), проверяет возможность отсылки сообщения (<code>check-msg-data</code>) и, в случае
  успеха, вызывает событие <code>crete-msg</code>, которое создает сообщение. В случае неудачи
  возбуждает ошибку, которую перехватит интерфейс сообщений. Сообщение создается
  недоставленным.
</p>
<p>
  Когда адресат сообщения (reciver) хочет узнать кол-во своих новых сообщений - он
  запрашивает функцию <code>get-undelivered-msg-cnt</code>.
</p>
<p>
  Если он хочет получить все идентификаторы непрочитанных сообщений, он вызывает
  <code>get-undelivered-msg-ids</code>
</p>
<p>
  Чтобы получить конкретное сообщение, адресат должен вызвать событие <code>delivery-msg</code>
</p>
<p>
  Страницы:
</p><ul>
<li>Страница отправки сообщения пользователю - на самом деле это должен быть попап на
    странице пользователя. Но пока сделаем так, чтобы снизить связность
</li>
<li>Страница переписки с конкретным пользова
</li>
</ul>




</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Шаблоны</h2>
<div class="outline-text-2" id="text-2">


<p>
  Соберем шаблоны сообщения
</p>



<pre class="src src-closure-template-html"><span style="color: #cd0000;">// -*- mode: closure-template-html; fill-column: 140 -*-</span>
{<span style="color: #00cd00; font-weight: bold;">namespace</span> <span style="color: #0000ee; font-weight: bold;">msgtpl</span>}

{<span style="color: #00cd00; font-weight: bold;">template</span> <span style="color: #0000ee; font-weight: bold;">sometpl}</span>
  &lt;&lt;<span style="color: #0000ee; font-weight: bold;">some_tpl</span>&gt;&gt;
{<span style="color: #00cd00; font-weight: bold;">/template</span>}
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Функционал</h2>
<div class="outline-text-2" id="text-3">


<p>
  Соберем контроллеры и все функции, которые контроллеры вызывают
</p>



<pre class="src src-lisp">(<span style="color: #00cdcd; font-weight: bold;">in-package</span> #<span style="color: #0000ee; font-weight: bold;">:moto</span>)

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1077;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;</span>
(closure-template:compile-template
 <span style="color: #0000ee; font-weight: bold;">:common-lisp-backend</span>
 (pathname
  (concatenate 'string *base-path* <span style="color: #00cd00;">"mod/msg/msg-tpl.htm"</span>)))

&lt;&lt;msg_fn_contents&gt;&gt;

&lt;&lt;msg_test&gt;&gt;
</pre>


<p>
  Мы вводим:
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Шаблон</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="src src-html">this is some tpl
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Страница диалогов</h3>
<div class="outline-text-3" id="text-3-2">


<p>
   На странице диалогов мы хотим видеть список всех диалогов. В каждом диалоге мы хотим
   видеть последнее сообщение. Чтобы получить последние сообщения мы вызываем
   <code>get-last-msg-dialog-ids-for-user-id</code>.
</p>




<pre class="src src-lisp">(<span style="color: #00cdcd; font-weight: bold;">in-package</span> #<span style="color: #0000ee; font-weight: bold;">:moto</span>)

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</span>
(restas:define-route im (<span style="color: #00cd00;">"/im"</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (concatenate
     'string
     <span style="color: #00cd00;">"&lt;h1&gt;&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;&lt;/h1&gt;"</span>
     (<span style="color: #00cdcd; font-weight: bold;">if</span> (not *current-user*)
         <span style="color: #00cd00;">"&#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1077; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;. &lt;a href=\"/login\"&gt;Login&lt;/a&gt;"</span>
         (<span style="color: #00cdcd; font-weight: bold;">let</span> ((msgs (get-last-msg-dialog-ids-for-user-id *current-user*)))
           (<span style="color: #00cdcd; font-weight: bold;">if</span> (equal 0 (length msgs))
               <span style="color: #00cd00;">"&#1053;&#1077;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;"</span>
               (format nil <span style="color: #00cd00;">"~{~A~}"</span>
                       (mapcar #'show-msg-id msgs))))))))
</pre>


</div>

</div>
