msg.org
** Событие отправки сообщения

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp

     ;; Событие отправки сообщения
     (defun create-msg (snd-id rcv-id msg)
       (let ((msg-id (id (make-msg :snd-id snd-id :rcv-id rcv-id :msg msg :ts-create (get-universal-time) :ts-delivery 0))))
         (dbg "Создано сообщение: ~A" msg-id)
         ;; Делаем его недоставленным
         (upd-msg (get-msg msg-id) (list :state ":UNDELIVERED"))
         ;; Возвращаем msg-id
         msg-id))
   #+END_SRC

** Функция получения кол-ва непрочитанных сообщений

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp

     ;; Функция получения кол-ва непрочитанных сообщений
     (defun get-undelivered-msg-cnt (rcv-id)
       (length (find-msg :rcv-id rcv-id :state ":UNDELIVERED")))
   #+END_SRC

** Функция получения идентификторов непрочитанных сообщений

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp

     ;; Функция получения идентификторов непрочитанных сообщений
     (defun get-undelivered-msg-ids (snd-id rcv-id)
       (mapcar #'id (find-msg :snd-id snd-id :rcv-id rcv-id :state ":UNDELIVERED")))
   #+END_SRC

** Событие доставки сообщения

   Если сообщение ранее не доставлялось - делаем его доставленным

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp

     ;; Функция получения идентификторов непрочитанных сообщений
     (defun delivery-msg (msg-id)
       (let ((msg (get-msg msg-id)))
         (if (equal ":UNDELIVERED" (state msg))
             (takt (get-msg msg-id) :delivered))
         msg))

   #+END_SRC

