msg.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Событие отправки сообщения</h3>
<div class="outline-text-3" id="text-3-3">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">create-msg</span> (snd-id rcv-id msg)
  (<span style="color: #00cdcd; font-weight: bold;">let</span> ((msg-id (id (make-msg <span style="color: #0000ee; font-weight: bold;">:snd-id</span> snd-id <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> rcv-id <span style="color: #0000ee; font-weight: bold;">:msg</span> msg <span style="color: #0000ee; font-weight: bold;">:ts-create</span> (get-universal-time) <span style="color: #0000ee; font-weight: bold;">:ts-delivery</span> 0))))
    (dbg <span style="color: #00cd00;">"&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;: ~A"</span> msg-id)
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1044;&#1077;&#1083;&#1072;&#1077;&#1084; &#1077;&#1075;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;</span>
    (upd-msg (get-msg msg-id) (list <span style="color: #0000ee; font-weight: bold;">:state</span> <span style="color: #00cd00;">":UNDELIVERED"</span>))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084; msg-id</span>
    msg-id))
</pre>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Функция получения кол-ва непрочитанных сообщений</h3>
<div class="outline-text-3" id="text-3-4">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1083;-&#1074;&#1072; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">get-undelivered-msg-cnt</span> (rcv-id)
  (length (find-msg <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> rcv-id <span style="color: #0000ee; font-weight: bold;">:state</span> <span style="color: #00cd00;">":UNDELIVERED"</span>)))
</pre>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Функция получения идентификторов непрочитанных сообщений</h3>
<div class="outline-text-3" id="text-3-5">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">get-undelivered-msg-ids</span> (snd-id rcv-id)
  (mapcar #'id (find-msg <span style="color: #0000ee; font-weight: bold;">:snd-id</span> snd-id <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> rcv-id <span style="color: #0000ee; font-weight: bold;">:state</span> <span style="color: #00cd00;">":UNDELIVERED"</span>)))
</pre>


</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Событие доставки сообщения</h3>
<div class="outline-text-3" id="text-3-6">


<p>
   Если сообщение ранее не доставлялось - делаем его доставленным
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">delivery-msg</span> (msg-id)
  (<span style="color: #00cdcd; font-weight: bold;">let</span> ((msg (get-msg msg-id)))
    (<span style="color: #00cdcd; font-weight: bold;">if</span> (equal <span style="color: #00cd00;">":UNDELIVERED"</span> (state msg))
        (takt (get-msg msg-id) <span style="color: #0000ee; font-weight: bold;">:delivered</span>))
    msg))

</pre>


</div>

</div>
