msg.org
** Функция получения последних сообщений диалогов для данного пользователя

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp
     (in-package #:moto)

     ;; Функция получения всех идентификаторов сообщений для данного пользователя
     (defun get-last-msg-dialog-ids-for-user-id (user-id)
       (with-connection *db-spec*
         (let* ((res-snd)
                (res-rcv)
                ;; Получим идентификторы всех, кто нам писал, по ним получим последнее написанное ими сообщение
                (snd (loop
                        :for sndr
                        :in  (query (:select :snd-id :distinct :from 'msg :where (:= :rcv-id user-id)))
                        :collect (query
                                  (:limit
                                   (:order-by
                                    (:select :id :snd-id :ts-create :msg :state
                                             :from 'msg
                                             :where (:and (:= :rcv-id user-id)
                                                          (:= :snd-id (car sndr))))
                                    (:desc :ts-create))
                                   1)
                                  )))
                ;; Получим идентификторы всех, кому мы писали, по ним получим последнее написанное нами сообщение
                (rcv (loop
                        :for rcvr
                        :in  (query (:select :rcv-id :distinct :from 'msg :where (:= :snd-id user-id)))
                        :collect (query
                                  (:limit
                                   (:order-by
                                    (:select :id :rcv-id :ts-create :msg :state
                                             :from 'msg
                                             :where (:and (:= :snd-id user-id)
                                                          (:= :rcv-id (car rcvr))))
                                    (:desc :ts-create))
                                   1)
                                  ))))
           ;; Проходим по тем последним сообщениям, что присланы нам
           (loop :for item :in snd :do
              ;; (dbg "~%:~A" item)
              ;; Проверяем, есть ли сообщение к этому абоненту в списке последних сообщений которые мы послали
              (aif (find (cadar item) rcv :key #'cadar)
                   ;; Если есть, то...
                   (progn
                     ;; (dbg "~%:Y: ~A - ~A" (caddar item) (caddar it))
                     ;; Смотрим, какое сообщение свежее
                     (if (> (caddar item) (caddar it))
                         ;; Если более позднее то, что нам прислали, то
                         ;; отправляем его в res-snd
                         (progn
                           (setf res-snd (append res-snd (list item)))
                           ;; (dbg "~%|YY|res-snd: ~A" res-snd)
                           )
                         ;; Если то, что послали мы, то оправляем его в res-rcv и удаляем из rcv - останутся только неспаренные
                         (progn
                           (setf res-rcv (append res-rcv (list it)))
                           ;; (dbg "~%|NN|res-rcv: ~A" res-rcv)
                           (setf rcv (remove it rcv)))))
                   ;; Если нет, то
                   (progn
                     ;; Результат отправляем то что есть в res-snd
                     (setf res-snd (append res-snd (list item)))
                     ;; (dbg "~%|N|res-snd: ~A" res-snd)
                     )))
           ;; Добавляем к res-rcv неспаренные остатки из rcv
           (setf res-rcv (append res-rcv rcv))
           ;; Добавим направление
           (setf res-rcv (mapcar #'(lambda (x)
                                     (append (car x) (list :rcv)))
                                 res-rcv))
           (setf res-snd (mapcar #'(lambda (x)
                                     (append (car x) (list :snd)))
                                 res-snd))
           ;; Объединим res-rcv и res-snd и отсортируем
           (sort
            (append res-snd res-rcv)
            #'(lambda (a b)
                (> (caddr a) (caddr b)))))))
   #+END_SRC

