msg.html

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Функция получения последних сообщений диалогов для данного пользователя</h3>
<div class="outline-text-3" id="text-3-7">





<pre class="src src-lisp">(<span style="color: #00cdcd; font-weight: bold;">in-package</span> #<span style="color: #0000ee; font-weight: bold;">:moto</span>)

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">get-last-msg-dialog-ids-for-user-id</span> (user-id)
  (<span style="color: #00cdcd; font-weight: bold;">with-connection</span> *db-spec*
    (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((res-snd)
           (res-rcv)
           <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1099; &#1074;&#1089;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1085;&#1072;&#1084; &#1087;&#1080;&#1089;&#1072;&#1083;, &#1087;&#1086; &#1085;&#1080;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; &#1080;&#1084;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</span>
           (snd (<span style="color: #00cdcd; font-weight: bold;">loop</span>
                   <span style="color: #0000ee; font-weight: bold;">:for</span> sndr
                   <span style="color: #0000ee; font-weight: bold;">:in</span>  (query (<span style="color: #0000ee; font-weight: bold;">:select</span> <span style="color: #0000ee; font-weight: bold;">:snd-id</span> <span style="color: #0000ee; font-weight: bold;">:distinct</span> <span style="color: #0000ee; font-weight: bold;">:from</span> 'msg <span style="color: #0000ee; font-weight: bold;">:where</span> (<span style="color: #0000ee; font-weight: bold;">:=</span> <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> user-id)))
                   <span style="color: #0000ee; font-weight: bold;">:collect</span> (query
                             (<span style="color: #0000ee; font-weight: bold;">:limit</span>
                              (<span style="color: #0000ee; font-weight: bold;">:order-by</span>
                               (<span style="color: #0000ee; font-weight: bold;">:select</span> <span style="color: #0000ee; font-weight: bold;">:id</span> <span style="color: #0000ee; font-weight: bold;">:snd-id</span> <span style="color: #0000ee; font-weight: bold;">:ts-create</span> <span style="color: #0000ee; font-weight: bold;">:msg</span>
                                        <span style="color: #0000ee; font-weight: bold;">:from</span> 'msg
                                        <span style="color: #0000ee; font-weight: bold;">:where</span> (<span style="color: #0000ee; font-weight: bold;">:and</span> (<span style="color: #0000ee; font-weight: bold;">:=</span> <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> user-id)
                                                     (<span style="color: #0000ee; font-weight: bold;">:=</span> <span style="color: #0000ee; font-weight: bold;">:snd-id</span> (car sndr))))
                               (<span style="color: #0000ee; font-weight: bold;">:desc</span> <span style="color: #0000ee; font-weight: bold;">:ts-create</span>))
                              1)
                             )))
           <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1099; &#1074;&#1089;&#1077;&#1093;, &#1082;&#1086;&#1084;&#1091; &#1084;&#1099; &#1087;&#1080;&#1089;&#1072;&#1083;&#1080;, &#1087;&#1086; &#1085;&#1080;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072;&#1084;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</span>
           (rcv (<span style="color: #00cdcd; font-weight: bold;">loop</span>
                   <span style="color: #0000ee; font-weight: bold;">:for</span> rcvr
                   <span style="color: #0000ee; font-weight: bold;">:in</span>  (query (<span style="color: #0000ee; font-weight: bold;">:select</span> <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> <span style="color: #0000ee; font-weight: bold;">:distinct</span> <span style="color: #0000ee; font-weight: bold;">:from</span> 'msg <span style="color: #0000ee; font-weight: bold;">:where</span> (<span style="color: #0000ee; font-weight: bold;">:=</span> <span style="color: #0000ee; font-weight: bold;">:snd-id</span> user-id)))
                   <span style="color: #0000ee; font-weight: bold;">:collect</span> (query
                             (<span style="color: #0000ee; font-weight: bold;">:limit</span>
                              (<span style="color: #0000ee; font-weight: bold;">:order-by</span>
                               (<span style="color: #0000ee; font-weight: bold;">:select</span> <span style="color: #0000ee; font-weight: bold;">:id</span> <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> <span style="color: #0000ee; font-weight: bold;">:ts-create</span> <span style="color: #0000ee; font-weight: bold;">:msg</span>
                                        <span style="color: #0000ee; font-weight: bold;">:from</span> 'msg
                                        <span style="color: #0000ee; font-weight: bold;">:where</span> (<span style="color: #0000ee; font-weight: bold;">:and</span> (<span style="color: #0000ee; font-weight: bold;">:=</span> <span style="color: #0000ee; font-weight: bold;">:snd-id</span> user-id)
                                                     (<span style="color: #0000ee; font-weight: bold;">:=</span> <span style="color: #0000ee; font-weight: bold;">:rcv-id</span> (car rcvr))))
                               (<span style="color: #0000ee; font-weight: bold;">:desc</span> <span style="color: #0000ee; font-weight: bold;">:ts-create</span>))
                              1)
                             ))))
      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1084; &#1087;&#1086; &#1090;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1085;&#1099; &#1085;&#1072;&#1084;</span>
      (<span style="color: #00cdcd; font-weight: bold;">loop</span> <span style="color: #0000ee; font-weight: bold;">:for</span> item <span style="color: #0000ee; font-weight: bold;">:in</span> snd <span style="color: #0000ee; font-weight: bold;">:do</span>
         <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">(dbg "~%:~A" item)</span>
         <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1084;, &#1077;&#1089;&#1090;&#1100; &#1083;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082; &#1101;&#1090;&#1086;&#1084;&#1091; &#1072;&#1073;&#1086;&#1085;&#1077;&#1085;&#1090;&#1091; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083;&#1080;</span>
         (aif (find (cadar item) rcv <span style="color: #0000ee; font-weight: bold;">:key</span> #'cadar)
              <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1045;&#1089;&#1083;&#1080; &#1077;&#1089;&#1090;&#1100;, &#1090;&#1086;...</span>
              (<span style="color: #00cdcd; font-weight: bold;">progn</span>
                <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">(dbg "~%:Y: ~A - ~A" (caddar item) (caddar it))</span>
                <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1082;&#1072;&#1082;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1077;&#1078;&#1077;&#1077;</span>
                (<span style="color: #00cdcd; font-weight: bold;">if</span> (&gt; (caddar item) (caddar it))
                    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1045;&#1089;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1079;&#1076;&#1085;&#1077;&#1077; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1083;&#1080;, &#1090;&#1086;</span>
                    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1077;&#1075;&#1086; &#1074; res-snd</span>
                    (<span style="color: #00cdcd; font-weight: bold;">progn</span>
                      (setf res-snd (append res-snd (list item)))
                      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">(dbg "~%|YY|res-snd: ~A" res-snd)</span>
                      )
                    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1045;&#1089;&#1083;&#1080; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083;&#1080; &#1084;&#1099;, &#1090;&#1086; &#1086;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1077;&#1075;&#1086; &#1074; res-rcv &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084; &#1080;&#1079; rcv - &#1086;&#1089;&#1090;&#1072;&#1085;&#1091;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1089;&#1087;&#1072;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077;</span>
                    (<span style="color: #00cdcd; font-weight: bold;">progn</span>
                      (setf res-rcv (append res-rcv (list it)))
                      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">(dbg "~%|NN|res-rcv: ~A" res-rcv)</span>
                      (setf rcv (remove it rcv)))))
              <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1090;, &#1090;&#1086;</span>
              (<span style="color: #00cdcd; font-weight: bold;">progn</span>
                <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1090;&#1086; &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074; res-snd</span>
                (setf res-snd (append res-snd (list item)))
                <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">(dbg "~%|N|res-snd: ~A" res-snd)</span>
                )))
      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1082; res-rcv &#1085;&#1077;&#1089;&#1087;&#1072;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1080; &#1080;&#1079; rcv</span>
      (setf res-rcv (append res-rcv rcv))
      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1084; res-rcv &#1080; res-snd &#1080; &#1086;&#1090;&#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;</span>
      (mapcar #'car
              (sort
               (append res-snd res-rcv)
               #'(<span style="color: #00cdcd; font-weight: bold;">lambda</span> (a b)
                   (&gt; (caddar a) (caddar b))))))))


</pre>


</div>

</div>
