msg.org
** Функция отображения одного сообщения в списке сообщений

   #+NAME: msg_fn_contents
   #+BEGIN_SRC lisp
     (in-package #:moto)

     ;; Функция отображения одного сообщения в списке сообщений
     (defun show-msg-id (msg-id)
       (format nil "<div>~A</div>"
               (msg (get-msg msg-id))))
   #+END_SRC

