msg.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Тесты</h2>
<div class="outline-text-2" id="text-4">


<p>
  Теперь у нас есть весь необходимый функционал, для работы авторизации. Мы можем его
  протестировать, для этого сформируем тест:
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">msg-test</span> ()
  &lt;&lt;msg_test_contents&gt;&gt;
  (dbg <span style="color: #00cd00;">"passed: msg-test~%"</span>))
(msg-test)
</pre>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1047;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;</span>
(<span style="color: #00cdcd; font-weight: bold;">let</span> ((alice (create-user <span style="color: #00cd00;">"alice"</span> <span style="color: #00cd00;">"aXJAVtBT"</span> <span style="color: #00cd00;">"alice@mail.com"</span>))
      (bob   (create-user <span style="color: #00cd00;">"bob"</span>   <span style="color: #00cd00;">"pDa84LAh"</span> <span style="color: #00cd00;">"bob@mail.com"</span>))
      (carol (create-user <span style="color: #00cd00;">"carol"</span> <span style="color: #00cd00;">"zDgjGus7"</span> <span style="color: #00cd00;">"carol@mail.com"</span>))
      (dave  (create-user <span style="color: #00cd00;">"dave"</span>  <span style="color: #00cd00;">"6zt5GmvE"</span> <span style="color: #00cd00;">"dave@mail.com"</span>)))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1091;&#1089;&#1090;&#1100; &#1040;&#1083;&#1080;&#1089;&#1072; &#1087;&#1086;&#1096;&#1083;&#1077;&#1090; &#1041;&#1086;&#1073;&#1091; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</span>
  (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((test-msg <span style="color: #00cd00;">"&#1055;&#1088;&#1080;&#1074;&#1077;&#1090;, &#1041;&#1086;&#1073;, &#1101;&#1090;&#1086; &#1040;&#1083;&#1080;&#1089;&#1072;!"</span>)
         (msg-id (create-msg alice bob test-msg)))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;</span>
    (<span style="color: #cd0000; font-weight: bold;">assert</span> (get-msg msg-id))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1077; "&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086;"</span>
    (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal <span style="color: #00cd00;">":UNDELIVERED"</span> (state (get-msg msg-id))))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1091;&#1089;&#1090;&#1100; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090; &#1082;&#1086;&#1083;-&#1074;&#1086; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</span>
    (<span style="color: #00cdcd; font-weight: bold;">let</span> ((undelivered-msg-cnt (get-undelivered-msg-cnt bob)))
      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1090;&#1072;&#1084; &#1086;&#1076;&#1085;&#1086; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</span>
      (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal 1 undelivered-msg-cnt))
      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1091;&#1089;&#1090;&#1100; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1074;&#1089;&#1077;&#1093; &#1089;&#1074;&#1086;&#1080;&#1093; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;</span>
      (<span style="color: #00cdcd; font-weight: bold;">let</span> ((undelivered-msg-ids (get-undelivered-msg-ids alice bob)))
        <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1085;&#1077;&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1086;&#1076;&#1080;&#1085; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;</span>
        (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal 1 (length undelivered-msg-ids)))
        <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1101;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</span>
        (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((read-msg-id (car undelivered-msg-ids))
               (read-msg (delivery-msg read-msg-id)))
          <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;</span>
          (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal test-msg (msg read-msg)))
          <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086;</span>
          (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal <span style="color: #00cd00;">":DELIVERED"</span> (state (get-msg read-msg-id))))))))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1091;&#1089;&#1090;&#1100; &#1041;&#1086;&#1073; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1090; &#1040;&#1083;&#1080;&#1089;&#1077; &#1080; &#1085;&#1072;&#1087;&#1080;&#1096;&#1077;&#1090; &#1050;&#1101;&#1088;&#1086;&#1083;</span>
  (sleep 1)
  (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((reply-bob-to-alice <span style="color: #00cd00;">"&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;, &#1040;&#1083;&#1080;&#1089;&#1072;, &#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083; &#1090;&#1074;&#1086;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086;. &#1071; &#1085;&#1072;&#1087;&#1080;&#1096;&#1091; &#1050;&#1101;&#1088;&#1086;&#1083; &#1095;&#1090;&#1086; &#1090;&#1099; &#1085;&#1072;&#1096;&#1083;&#1072; &#1084;&#1077;&#1085;&#1103;"</span>)
         (reply-bob-to-alice-id (create-msg bob alice reply-bob-to-alice)))
    (sleep 1)
    (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((msg-bob-to-carol <span style="color: #00cd00;">"&#1050;&#1101;&#1088;&#1086;&#1083;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102; &#1087;&#1088;&#1080;&#1074;&#1077;&#1090; &#1086;&#1090; &#1040;&#1083;&#1080;&#1089;&#1099;. &#1041;&#1086;&#1073;."</span>)
           (msg-bob-to-carol-id (create-msg bob carol msg-bob-to-carol)))
      (sleep 1)
      <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1091;&#1089;&#1090;&#1100; &#1044;&#1101;&#1081;&#1074; &#1085;&#1072;&#1087;&#1080;&#1096;&#1077;&#1090; &#1041;&#1086;&#1073;&#1091;</span>
      (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((msg-dave-to-bob <span style="color: #00cd00;">"&#1055;&#1088;&#1080;&#1074;&#1077;&#1090;, &#1041;&#1086;&#1073;, &#1103; &#1093;&#1086;&#1095;&#1091; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1090;&#1077;&#1073;&#1103; &#1074; &#1076;&#1088;&#1091;&#1079;&#1100;&#1103;"</span>)
             (msg-dave-to-bob-id (create-msg dave bob msg-dave-to-bob)))
        <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1080; &#1041;&#1086;&#1073;&#1072;</span>
        (<span style="color: #00cdcd; font-weight: bold;">let</span> ((last-dialogs (get-last-msg-dialog-ids-for-user-id bob)))
          (dbg <span style="color: #00cd00;">"~%~A"</span> (bprint last-dialogs))
          <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1080;&#1084;&#1077;&#1077;&#1084; &#1090;&#1088;&#1080; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072;</span>
          (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal 3 (length last-dialogs)))
          <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1099;</span>
          (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal (list msg-dave-to-bob-id
                               msg-bob-to-carol-id
                               reply-bob-to-alice-id)
                         (mapcar #'car last-dialogs))))))))
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-10-15T00:17+0400</p>
<p class="author">Author: rigidus</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
